var clothesNotice = "03.11 更新2套婚纱及单品";

var clothesHistoryNotice = "03.10 更新衣柜V1.7.0<br>03.04 更新衣柜：签到、西尔维娅夫人套。<br>02.23 更新衣柜：鹿皮小靴，修复青花语属性。<br>02.19 更新衣柜：柔情蜜意套；修复错误属性。<br>02.13 更新衣柜：蜜语甜心、玫瑰情浓<br>02.11 更新衣柜：灵猴套、金猴套、烟竹伴雪、十字星泪等；更新设计图：格莱斯、女巫套、夜魅套等<br>02.05 更新衣柜：踏雪套、桃红套、木偶套<br>02.01 更新衣柜：福袋5套、联盟的恋爱套、女侠套、王冠套。<br>01.30 更新衣柜：物换星移；更新设计图：寒月";

var levelNotice = "03.11 更新婚纱关卡。第十二章F品缓慢填坑中。<br>F了先脱外套，不行再换连衣裙上下装。已有F品的同系列进化染色可能都F、新品易F，切记。不知道是哪件衣服导致F的，留言请注明所穿外套 & 连衣裙或上下装。";

var levelHistoryNotice = "<br>03.09 更新第十二章。tag可能不准、NPC技能不全、F品收集中，请大家多多反馈，明天继续更新。<br>03.05 补测双倍关卡（五七章）新品，反馈整理。非常感谢花舞_沐风和凉夜的无私帮助！<br>02.28 过关提示及F品更新，技能修复。<br>02.25 补测双倍关卡（一三十章）新品。<br>02.21 过关提示及F品更新。<br>02.17 联盟增加少量F品。<br>02.08 春节快乐！过关提示及F品更新。<br>02.02 更新了联盟第三章。"
